#Задание 1
a = int(input("Введите a = "))
b = int(input("Ведите b = "))
if a > b:
  print ("a больше")
elif a < b:
  print ("b больше")
else :
  print ("они равны")