#Задание 2
a = float(input("Введите a = "))
b = float(input("Ведите b = "))
if a > b:
  print ("a больше")
elif a < b:
  print ("b больше")
else :
  print ("они равны")